Repository: pingfangx/TranslatorX-other
Catalog: JavaDocs/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: When a thread is about to terminate due to an uncaught exception the Java Virtual Machine will query the thread for its UncaughtExceptionHandler using getUncaughtExceptionHandler() and will invoke the handler's uncaughtException method, passing the thread and the exception as arguments.
zh_cn: 当某一线程因未捕获的异常而即将终止时，Java 虚拟机将使用 getUncaughtExceptionHandler() 查询该线程以获得其 UncaughtExceptionHandler 的线程，并调用处理程序的 uncaughtException 方法，将线程和异常作为参数传递。

source: When a thread is terminated, this thread ID may be reused.
zh_cn: 线程终止时，该线程 ID 可以被重新使用。

source: When a thread sees an update to an atomic variable caused by a weakCompareAndSet, it does not necessarily see updates to any other variables that occurred before the weakCompareAndSet.
zh_cn: 当一个线程看到对 weakCompareAndSet 导致的原子变量的更新时，它不一定能看到在 weakCompareAndSet 之前发生的对任何其他 变量的更新。

source: When allocated, length is always a power of two.
zh_cn: 在分配时，长度总是 2 的幂。

source: When an object implementing interface Runnable is used to create a thread, starting the thread causes the object's run method to be called in that separately executing thread.
zh_cn: 使用实现接口 Runnable 的对象创建一个线程时，启动该线程将导致在独立执行的线程中调用对象的 run 方法。

source: When bin lists are treeified, split, or untreeified, we keep them in the same relative access/traversal order (i.e., field Node.next) to better preserve locality, and to slightly simplify handling of splits and traversals that invoke iterator.remove.
zh_cn: 当 bin 列表被树化，分裂或者取消树化时，我们使它们保持相同的相对访问/遍历顺序（即，字段 Node.next）以更好地保持局部性，并略微简化调用 iterator.remove 的分割和遍历的处理。

source: When code running in some thread creates a new Thread object, the new thread has its priority initially set equal to the priority of the creating thread, and is a daemon thread if and only if the creating thread is a daemon.
zh_cn: 当某个线程中运行的代码创建一个新 Thread 对象时，该新线程的初始优先级被设定为创建线程的优先级，并且当且仅当创建线程是守护线程时，新线程才是守护程序。

source: When discussing the accuracy of a method as a whole rather than at a specific argument, the number of ulps cited is for the worst-case error at any argument.
zh_cn: 当作为一个整体而不是针对具体参数讨论方法的准确性时，引入的 ulp 数用于任何参数最差情况下的误差。

source: When many threads are expected to access a given collection, a ConcurrentHashMap is normally preferable to a synchronized HashMap, and a ConcurrentSkipListMap is normally preferable to a synchronized TreeMap.
zh_cn: 当期望许多线程访问一个给定 collection 时，ConcurrentHashMap 通常优于同步的 HashMap，ConcurrentSkipListMap 通常优于同步的 TreeMap。

source: When passing information to a Java subprocess, system properties are generally preferred over environment variables.
zh_cn: 当将信息传递给 Java 子进程时，系统属性通常优先于环境变量。

source: When requested to find a class or resource, a ClassLoader instance will delegate the search for the class or resource to its parent class loader before attempting to find the class or resource itself.
zh_cn: 需要查找类或资源时，ClassLoader 实例会在试图亲自查找类或资源之前，将搜索类或资源的任务委托给其父类加载器。

source: When such a duplicate method is invoked on a proxy instance, the Method object passed to the invocation handler will not necessarily be the one whose declaring class is assignable from the reference type of the interface that the proxy's method was invoked through.
zh_cn: 在代理实例上调用重复方法 时，传递到调用处理程序的 Method 对象没有必要成为其声明类可以从接口（通过该接口调用代理方法）的引用类型指派的对象。

source: When the number of entries in the hash table exceeds the product of the load factor and the current capacity, the hash table is rehashed (that is, internal data structures are rebuilt) so that the hash table has approximately twice the number of buckets.
zh_cn: 当哈希表中的条目数超出了加载因子与当前容量的乘积时，则要对该哈希表进行 rehash 操作（即重建内部数据结构），从而哈希表将具有大约两倍的桶数。

source: When the weak references to a weakly-reachable object are cleared, the object becomes eligible for finalization.
zh_cn: 当清除对某一弱可到达对象的弱引用时，便可以终止此对象了。

source: When two or more interfaces of a proxy class contain a method with the same name and parameter signature, the order of the proxy class's interfaces becomes significant.
zh_cn: 当代理类的两个或多个接口包含一个具有相同名称和参数签名的方法时，代理类的接口顺序变得非常重要。

source: When using comparators on insertion, to keep a total ordering (or as close as is required here) across rebalancings, we compare classes and identityHashCodes as tie-breakers.
zh_cn: 为了在整个重定位过程中保持总体排序（或尽可能接近此处所需），我们比较类和 identityHashCodes 用作联合破坏。

source: When we say that a class's natural ordering is consistent with equals, we mean that the quotient for the natural ordering is the equivalence relation defined by the class's equals(Object) method:
zh_cn: 当说到类的自然排序与 equals 一致 时，是指自然排序的商是由类的 equals(Object) 方法定义的等价关系。

source: Whenever a process builder is created, the environment is initialized to a copy of the current process environment (see getenv()).
zh_cn: 无论进程生成器何时创建，都需要将环境初始化为一份当前进程环境的副本（请参阅 getenv()）。

source: Whenever an operation occurs involving a source sequence (such as appending or inserting from a source sequence) this class synchronizes only on the string buffer performing the operation, not on the source.
zh_cn: 当发生与源序列有关的操作（如源序列中的追加或插入操作）时，该类只在执行此操作的字符串缓冲区上而不是在源上实现同步。

source: Whenever it is invoked on the same object more than once during an execution of a Java application, the hashCode method must consistently return the same integer, provided no information used in equals comparisons on the object is modified.
zh_cn: 在 Java 应用程序执行期间，在对同一对象多次调用 hashCode 方法时，必须一致地返回相同的整数，前提是将对象进行 equals 比较时所用的信息没有被修改。

source: Where fdlibm provides more than one definition for a function (such as acos), use the "IEEE 754 core function" version (residing in a file whose name begins with the letter e).
zh_cn: 其中 fdlibm 使用“IEEE 754 核心函数”版本（位于名字以字母 e 开头的文件中）为一个函数提供了多个定义（如 acos）。

source: Where possible, it is recommended that this class be used in preference to StringBuffer as it will be faster under most implementations.
zh_cn: 如果可能，建议优先采用该类，因为在大多数实现中，它比 StringBuffer 要快。

source: Which commands are valid is system-dependent, but at the very least the command must be a non-empty list of non-null strings.
zh_cn: 哪些命令有效取决于系统，但是该命令至少必须有一个非 null 字符串的非空列表。

source: Which string lists represent a valid operating system command is system-dependent.
zh_cn: 在此，表示有效的操作系统命令的字符串列表是依赖于系统的。

source: While it is typically the case that:
zh_cn: 一般情况下：

source: While methods like getByName(String) are guaranteed not to return an Inet6Address when looking up host names, it is possible, by passing literals, to create such an object.
zh_cn: 虽然可以保证在查找主机名时 getByName(String) 之类的方法不返回 Inet6Address，但仍然可能通过传递字面值来创建此类对象。

source: While some programs will choose to dedicate a thread to removing reference objects from one or more queues and processing them, this is by no means necessary.
zh_cn: 虽然某些程序会选择专门使用一个线程从一个或多个队列中移除引用对象并处理它们，但这是绝对没有必要的。

source: While this style of queuing can be useful in smoothing out transient bursts of requests, it admits the possibility of unbounded work queue growth when commands continue to arrive on average faster than they can be processed.
zh_cn: 这种排队可用于处理瞬态突发请求，当命令以超过队列所能处理的平均数连续到达时，此策略允许无界线程具有增长的可能性。

source: While this will rarely occur in practice, applications must guard against it by testing for the condition that should have caused the thread to be awakened, and continuing to wait if the condition is not satisfied.
zh_cn: 虽然这种情况在实践中很少发生，但是应用程序必须通过以下方式防止其发生，即对应该导致该线程被提醒的条件进行测试，如果不满足该条件，则继续等待。

source: WildcardType represents a wildcard type expression, such as ?, ? extends Number, or ? super Integer.
zh_cn: WildcardType 表示一个通配符类型表达式，如 ? 、 ? extends Number 或 ? super Integer。

source: Within each ClassLoader instance all classes from the same java package have the same Package object.
zh_cn: 在每一个 ClassLoader 实例中，相同 java 包中的所有类都有相同的 Package 对象。

source: Wraps an IOException with an unchecked exception.
zh_cn: 用非检查型异常包装 IOException。

source: Write out the threshold, loadfactor, and any hidden stuff
zh_cn: 写出阈值、负载因子和任何隐藏的东西

source: Writes and reads of volatile fields have similar memory consistency effects as entering and exiting monitors, but do not entail mutual exclusion locking.
zh_cn: volatile 字段的读取和写入与进入和退出监视器具有相似的内存一致性效果，但不 需要互斥锁。

source: Writes text to a character-output stream, buffering characters so as to provide for the efficient writing of single characters, arrays, and strings.
zh_cn: 将文本写入字符输出流，缓冲各个字符，从而提供单个字符、数组和字符串的高效写入。

source: You can also hold floats using floatToRawIntBits(float) and intBitsToFloat(int) conversions, and doubles using doubleToRawLongBits(double) and longBitsToDouble(long) conversions.
zh_cn: 也可以使用 floatToRawIntBits(float) 和 intBitsToFloat(int) 转换来保持 float 值，使用 doubleToRawLongBits(double) 和 longBitsToDouble(long) 转换来保持 double 值。

source: You probably want to prestart threads if you construct the pool with a non-empty queue.
zh_cn: 如果构造带有非空队列的池，则可能希望预先启动线程。

source: a Type object representing the type that this type is a member of.
zh_cn: Type 对象，表示此类型是其成员之一的类型。

source: a command, a list of strings which signifies the external program file to be invoked and its arguments, if any.
zh_cn: 命令 是一个字符串列表，它表示要调用的外部程序文件及其参数（如果有）。

source: a working directory.
zh_cn: 工作目录。

source: a collection view of the values contained in this map
zh_cn: 此映射中包含的值的 collection 视图

source: a proxy class that is defined in the specified class loader and that implements the specified interfaces
zh_cn: 用指定的类加载器定义的代理类，它可以实现指定的接口

source: a proxy instance with the specified invocation handler of a proxy class that is defined by the specified class loader and that implements the specified interfaces
zh_cn: 一个带有代理类的指定调用处理程序的代理实例，它由指定的类加载器定义，并实现指定的接口

source: a set view of the keys contained in this map
zh_cn: 此映射中包含的键的 set 视图

source: a set view of the mappings contained in this map
zh_cn: 此映射所包含的映射关系的 set 视图。

source: a shallow copy of this map
zh_cn: 此映射的浅表副本

source: advance to first entry
zh_cn: 前进到第一个条目

source: aka 16
zh_cn: 即 16

source: all annotations present on this element
zh_cn: 此元素上存在的所有注释

source: all other fields defaulted
zh_cn: 其他所有字段默认

source: always check first node
zh_cn: 总是检查第一个节点

source: an environment, which is a system-dependent mapping from variables to values.
zh_cn: 环境 是从变量 到值 的依赖于系统的映射。

source: an array of Type objects representing the actual type arguments to this type
zh_cn: 表示此类型的实际类型参数的 Type 对象的数组

source: an array of Types representing the upper bound(s) of this type variable
zh_cn: 表示此类型变量的上边界的 Type 的数组

source: an array of TypeVariable objects that represent the type variables declared by this generic declaration
zh_cn: 表示由此一般声明声明的类型变量的 TypeVariable 对象的数组

source: an array of Types representing the lower bound(s) of this type variable
zh_cn: 表示此类型变量下边界的类型的数组

source: an array of objects containing the values of the arguments passed in the method invocation on the proxy instance, or null if interface method takes no arguments.
zh_cn: 包含传入代理实例上方法调用的参数值的对象数组，如果接口方法不使用参数，则为 null

source: an object representing the declaring class of the underlying member
zh_cn: 表示声明底层成员的类的对象

source: and the following cast operation will succeed (rather than throwing a ClassCastException):
zh_cn: 并且以下的强制转换操作将会成功（而不抛出 ClassCastException）：

source: any character for which isDigit(char) returns true, e.g. 0, 1, 2, ...
zh_cn: isDigit(char) 会对其返回 true 的任何字符，如 0、1、2 等等。

source: behaves in exactly the same way as the invocation
zh_cn: 与下列方法调用完全相同：

source: bypass checks
zh_cn: 绕过检查

source: clear, flip, rewind, and mark/reset
zh_cn: 清除，反转，重绕和标记/重置

source: current entry
zh_cn: 当前条目

source: current index, modified on advance/split
zh_cn: 当前索引，在前进/拆分时修改

source: current node
zh_cn: 当前节点

source: current slot
zh_cn: 当前插槽

source: detach
zh_cn: 分离

source: double threshold
zh_cn: 阈值加倍

source: enum classes cannot have finalize methods.
zh_cn: 枚举类不能有 finalize 方法。

source: existing mapping for key
zh_cn: 已存在键的映射

source: false when initially constructing this map, else true (relayed to method afterNodeInsertion).
zh_cn: 在初始化构造 map 时为 false,否则为 true (传到方法 afterNodeInsertio)

source: field holds the initial array capacity, or zero signifying
zh_cn: 则此字段保存初始数组容量，

source: find successor
zh_cn: 寻找继任者

source: for cast to Comparable
zh_cn: 用于转为 Comparable

source: for comodification checks
zh_cn: 用于共同修改检查

source: for fast-fail
zh_cn: 用于快速失败

source: force init
zh_cn: 强制初始化

source: hash for key
zh_cn: 键的哈希

source: if B is a parameterized type or a type variable, it is created, (see ParameterizedType for the details of the creation process for parameterized types).
zh_cn: 如果 B 是一个参数化类型或一个类型变量，则会创建它（请参见 ParameterizedType，了解创建参数化类型过程的详细信息）。

source: if any of the actual type arguments refers to a non-existent type declaration
zh_cn: 如果任何实际类型参数引用不存在的类型声明

source: if any of the actual type parameters refer to a parameterized type that cannot be instantiated for any reason
zh_cn: 如果任何实际类型参数引用参数化类型，该类型出于某种原因无法被实例化

source: if any of the bounds refer to a parameterized type that cannot be instantiated for any reason
zh_cn: 如果任一边界引用出于某种原因不能被实例化的参数化类型

source: if any of the bounds refers to a non-existent type declaration
zh_cn: 如果任一边界引用不存在的类型声明

source: if any of the restrictions on the parameters that may be passed to getProxyClass are violated
zh_cn: 如果违反传递到 getProxyClass 的参数上的任何限制

source: if false do not move other nodes while removing
zh_cn: 如果为 false，则在移除时不要移动其他节点

source: if false, the table is in creation mode.
zh_cn: 如果为 false，该表是在创建模式。

source: if the interfaces array argument or any of its elements are null
zh_cn: 如果 interfaces 数组参数或其任何元素为 null

source: if the interfaces array argument or any of its elements are null, or if the invocation handler, h, is null
zh_cn: 如果 interfaces 数组参数或其任何元素为 null，或如果调用处理程序 h 为 null

source: if the argument is not a proxy instance
zh_cn: 如果参数不是一个代理实例

source: if the generic signature of this generic declaration does not conform to the format specified in The Java™ Virtual Machine Specification
zh_cn: 如果此一般声明的一般签名不符合 The Java™ Virtual Machine Specification 指定的格式。

source: if the given annotation class is null
zh_cn: 如果给定的注释类为 null

source: if the initial capacity is negative or the load factor is nonpositive
zh_cn: 如果初始容量为负或者加载因子为非正

source: if the initial capacity is negative.
zh_cn: 如果初始容量为负。

source: if the owner type refers to a non-existent type declaration
zh_cn: 如果所有者类型引用了一个不存在的类型声明

source: if the owner type refers to a parameterized type that cannot be instantiated for any reason
zh_cn: 如果所有者类型引用了出于某些原因无法实例化的参数化类型

source: if the specified map is null
zh_cn: 如果指定的映射为 null

source: if true only remove if value is equal
zh_cn: 如果为 true，则仅当值相等时移除

source: if true, don't change existing value
zh_cn: 如果为 true，则不改变现有的值

source: initial capacity was placed in threshold
zh_cn: 初始容量被放置在阈值

source: initialize fence and size on first use
zh_cn: 首次使用时初始化围栏和大小

source: is equivalent to:
zh_cn: 等效于：

source: iterators
zh_cn: 迭代器

source: k==null : key.equals(k)), then this method returns v; otherwise it returns null.
zh_cn: k==null : key.equals(k)) 的，则此方法返回 v；否则返回 null。

source: key whose mapping is to be removed from the map
zh_cn: 其映射关系要从映射中移除的键

source: key with which the specified value is associated
zh_cn: 与指定值相关联的键

source: key with which the specified value is to be associated
zh_cn: 指定值将要关联的键

source: mappings to be stored in this map
zh_cn: 要在此映射中存储的映射关系

source: more: less than 1 in ten million
zh_cn: 更多：小于千万分之一。

source: needed to unlink next upon deletion
zh_cn: 删除后需要取消链接

source: next entry to return
zh_cn: 下一个要返回的条目

source: null : cause.toString()) (which typically contains the class and detail message of cause).
zh_cn: null :cause.toString()) 的详细消息来构造新的错误（通常包含 cause 的类和详细消息）。

source: one past last index
zh_cn: 上一个索引

source: or more simply:
zh_cn: 或使用以下更简单的方法：

source: p was s's direct parent
zh_cn: p 是 s 的直接父

source: preserve order
zh_cn: 维持顺序

source: previous value, or null if none
zh_cn: 以前的值，如果没有则为 null

source: range of 0.25...4.0
zh_cn: 范围 0.25...4.0

source: red-black tree links
zh_cn: 红黑树链接

source: root of tree
zh_cn: 树的根

source: size estimate
zh_cn: 规模估算

source: spliterators
zh_cn: 分割器

source: swap colors
zh_cn: 交换颜色

source: symmetric
zh_cn: 对称

source: the (possibly wrapped) value of the indexed component in the specified array
zh_cn: 指定数组中索引组件的（可能已封装的）值

source: the Method instance corresponding to the interface method invoked on the proxy instance.
zh_cn: 对应于在代理实例上调用的接口方法的 Method 实例。

source: the Class object corresponding to the annotation type
zh_cn: 对应于注释类型的 Class 对象

source: the bit of hash to split on
zh_cn: 要拆分的哈希位

source: the cause of this exception.
zh_cn: 此异常的原因。

source: the character at index k in the old character sequence, if k is less than offset
zh_cn: 如果 k 小于 offset，则等于原字符序列中索引 k 处的字符。

source: the character at index k in this sequence, if k is less than dstOffset
zh_cn: 如果 k 小于 dstOffset，则等于原序列中索引 k 处的字符。

source: the character at index k+start-dstOffset in the argument s, if k is greater than or equal to dstOffset but is less than dstOffset+end-start
zh_cn: 如果 k 大不等于 dstOffset 但小于 dstOffset+end-start，则等于 s 参数中索引 k+start-dstOffset 中的字符。

source: the character at index k-(end-start) in this sequence, if k is greater than or equal to dstOffset+end-start
zh_cn: 如果 k 大于等于 dstOffset+end-start，则等于原序列中索引 k-(end-start) 处的字符

source: the character at index k-offset in the argument str, if k is not less than offset but is less than offset+str.length()
zh_cn: 如果 k 不小于 offset 但小于 offset+str.length()，则等于 str 参数中索引 k-offset 中的字符。

source: the character at index k-str.length() in the old character sequence, if k is not less than offset+str.length()
zh_cn: 如果 k 不小于 offset+str.length()，则等于原字符序列中索引 k-str.length() 处的字符

source: the class loader to define the proxy class
zh_cn: 定义代理类的类加载器

source: the class to test
zh_cn: 要测试的类

source: the detail message
zh_cn: 详细消息

source: the exception to throw from the method invocation on the proxy instance.
zh_cn: 从代理实例上的方法调用抛出的异常。

source: the function to apply to each entry
zh_cn: 应用于每个条目的函数

source: the generic declaration declared for this type variable.
zh_cn: 为此类型变量声明的一般声明。

source: the index
zh_cn: 索引

source: the index of the table being split
zh_cn: 被拆分表的索引

source: the initial capacity
zh_cn: 初始容量。

source: the initial capacity.
zh_cn: 初始容量。

source: the invocation handler for the proxy instance
zh_cn: 此代理实例的调用处理程序

source: the invocation handler for this proxy instance
zh_cn: 此代理实例的调用处理程序

source: the invocation handler for this proxy instance.
zh_cn: 此代理实例的调用处理程序。

source: the invocation handler to dispatch method invocations to
zh_cn: 指派方法调用的调用处理程序

source: the key
zh_cn: 键

source: the key whose associated value is to be returned
zh_cn: 要返回其关联值的键

source: the list of interfaces for the proxy class to implement
zh_cn: 代理类要实现的接口列表

source: the load factor
zh_cn: 加载因子

source: the map
zh_cn: 映射

source: the map whose mappings are to be placed in this map
zh_cn: 映射，其映射关系将存放在此映射中

source: the name of this type variable, as it appears in the source code
zh_cn: 此类型变量的名称，它出现在源代码中

source: the node, or null if none
zh_cn: 节点，如果没有则为 null

source: the number of key-value mappings in this map
zh_cn: 此映射中的键-值映射关系数

source: the previous value associated with key, or null if there was no mapping for key.
zh_cn: 与 key 关联的旧值；如果 key 没有任何映射关系，则返回 null。

source: the proxy instance that the method was invoked on
zh_cn: 在其上调用方法的代理实例

source: the proxy instance to return the invocation handler for
zh_cn: 返回调用处理程序的代理实例

source: the simple name of the underlying member
zh_cn: 底层成员的简单名称

source: the table for recording bin heads
zh_cn: 记录 bin 头的表

source: the type of keys maintained by this map
zh_cn: 此映射所维护的键的类型

source: the type of mapped values
zh_cn: 所映射值的类型

source: the undeclared checked exception that was thrown
zh_cn: 抛出的经过检查的未声明异常

source: the value of the indexed component in the specified array
zh_cn: 指定数组中索引组件的值

source: the value of the object's accessible flag
zh_cn: 此对象的 accessible 标志的值。

source: the value to match if matchValue, else ignored
zh_cn: 如果 matchValue 为 true 表示匹配值，否则忽略

source: the value to put
zh_cn: 要设置的值

source: the value to return from the method invocation on the proxy instance.
zh_cn: 从代理实例的方法调用返回的值。

source: the value to which the specified key is mapped, or null if this map contains no mapping for the key
zh_cn: 指定键所映射的值；如果此映射不包含该键的映射关系，则返回 null

source: they are guaranteed to traverse elements as they existed upon construction exactly once, and may (but are not guaranteed to) reflect any modifications subsequent to construction.
zh_cn: 它们保证遍历元素，因为它们在构造上确实存在一次，并且可能(但不能保证)反映在构造之后的任何修改。

source: they may proceed concurrently with other operations
zh_cn: 他们可以与其他操作同时进行

source: they will never throw ConcurrentModificationException
zh_cn: 它们不会抛出 ConcurrentModificationException

source: this element's annotation for the specified annotation type if present on this element, else null
zh_cn: 如果该元素的指定注释类型的注释存在于此对象上，则返回这些注释，否则返回 null

source: this shouldn't happen, since we are Cloneable
zh_cn: 这不应该发生，因为我们是 Cloneable 的

source: to entities capable of performing I/O operations; and
zh_cn: 它们表示到能够执行 IO 操作；

source: too small
zh_cn: 太小

source: true if an annotation for the specified annotation type is present on this element, else false
zh_cn: 如果指定注释类型的注释存在于此对象上，则返回 true，否则返回 false

source: true if and only if this member was introduced by the compiler.
zh_cn: 当且仅当编译器引入此对象时，才返回 true。

source: type arg is c
zh_cn: 类型参数是 c

source: value expected to be associated with the specified key
zh_cn: 应与指定键关联的值

source: value to be associated with the specified key
zh_cn: 指定键将要关联的值

source: value whose presence in this map is to be tested
zh_cn: 要测试其是否在此映射中存在的值

source: where equals has the semantics of Objects.equals.
zh_cn: 其中 equals 具有 Objects.equals 语义。

source: which translate between bytes and Unicode characters;
zh_cn: 它们在字节和 Unicode 字符之间进行转换；

source: will be true, but these are not absolute requirements.
zh_cn: 为 true，但这些并非必须要满足的要求。

source: will be true, this is not an absolute requirement.
zh_cn: 为 true，但这并非必须要满足的要求。

source: will be true, and that the expression:
zh_cn: 为 true，表达式：

source: write your utility method as follows:
zh_cn: 编写实用方法如下：

source: zero initial threshold signifies using defaults
zh_cn: 零初始阈值表示使用默认值
